virtualabs/cutcutgo/src/packs/PIC32CM5164LE00100_DFP/component/ac.h
#define AC_INTFLAG_COMP0_Pos                  _UINT8_(0)                                           /* (AC_INTFLAG) Comparator 0 Position */
#define AC_INTFLAG_COMP0_Msk                  (_UINT8_(0x1) << AC_INTFLAG_COMP0_Pos)               /* (AC_INTFLAG) Comparator 0 Mask */
#define AC_INTFLAG_COMP0(value)               (AC_INTFLAG_COMP0_Msk & (_UINT8_(value) << AC_INTFLAG_COMP0_Pos)) /* Assigment of value for COMP0 in the AC_INTFLAG register */
#define AC_INTFLAG_COMP1_Pos                  _UINT8_(1)                                           /* (AC_INTFLAG) Comparator 1 Position */
#define AC_INTFLAG_COMP1_Msk                  (_UINT8_(0x1) << AC_INTFLAG_COMP1_Pos)               /* (AC_INTFLAG) Comparator 1 Mask */
#define AC_INTFLAG_COMP1(value)               (AC_INTFLAG_COMP1_Msk & (_UINT8_(value) << AC_INTFLAG_COMP1_Pos)) /* Assigment of value for COMP1 in the AC_INTFLAG register */
#define AC_INTFLAG_COMP2_Pos                  _UINT8_(2)                                           /* (AC_INTFLAG) Comparator 2 Position */
#define AC_INTFLAG_COMP2_Msk                  (_UINT8_(0x1) << AC_INTFLAG_COMP2_Pos)               /* (AC_INTFLAG) Comparator 2 Mask */
#define AC_INTFLAG_COMP2(value)               (AC_INTFLAG_COMP2_Msk & (_UINT8_(value) << AC_INTFLAG_COMP2_Pos)) /* Assigment of value for COMP2 in the AC_INTFLAG register */
#define AC_INTFLAG_COMP3_Pos                  _UINT8_(3)                                           /* (AC_INTFLAG) Comparator 3 Position */
#define AC_INTFLAG_COMP3_Msk                  (_UINT8_(0x1) << AC_INTFLAG_COMP3_Pos)               /* (AC_INTFLAG) Comparator 3 Mask */
#define AC_INTFLAG_COMP3(value)               (AC_INTFLAG_COMP3_Msk & (_UINT8_(value) << AC_INTFLAG_COMP3_Pos)) /* Assigment of value for COMP3 in the AC_INTFLAG register */
#define AC_INTFLAG_WIN0_Pos                   _UINT8_(4)                                           /* (AC_INTFLAG) Window 0 Position */
#define AC_INTFLAG_WIN0_Msk                   (_UINT8_(0x1) << AC_INTFLAG_WIN0_Pos)                /* (AC_INTFLAG) Window 0 Mask */
#define AC_INTFLAG_WIN0(value)                (AC_INTFLAG_WIN0_Msk & (_UINT8_(value) << AC_INTFLAG_WIN0_Pos)) /* Assigment of value for WIN0 in the AC_INTFLAG register */
#define AC_INTFLAG_WIN1_Pos                   _UINT8_(5)                                           /* (AC_INTFLAG) Window 1 Position */
#define AC_INTFLAG_WIN1_Msk                   (_UINT8_(0x1) << AC_INTFLAG_WIN1_Pos)                /* (AC_INTFLAG) Window 1 Mask */
#define AC_INTFLAG_WIN1(value)                (AC_INTFLAG_WIN1_Msk & (_UINT8_(value) << AC_INTFLAG_WIN1_Pos)) /* Assigment of value for WIN1 in the AC_INTFLAG register */
#define AC_INTFLAG_Msk                        _UINT8_(0x3F)                                        /* (AC_INTFLAG) Register Mask  */

#define AC_INTFLAG_COMP_Pos                   _UINT8_(0)                                           /* (AC_INTFLAG Position) Comparator x */
#define AC_INTFLAG_COMP_Msk                   (_UINT8_(0xF) << AC_INTFLAG_COMP_Pos)                /* (AC_INTFLAG Mask) COMP */
#define AC_INTFLAG_COMP(value)                (AC_INTFLAG_COMP_Msk & (_UINT8_(value) << AC_INTFLAG_COMP_Pos)) 
#define AC_INTFLAG_WIN_Pos                    _UINT8_(4)                                           /* (AC_INTFLAG Position) Window x */
#define AC_INTFLAG_WIN_Msk                    (_UINT8_(0x3) << AC_INTFLAG_WIN_Pos)                 /* (AC_INTFLAG Mask) WIN */
#define AC_INTFLAG_WIN(value)                 (AC_INTFLAG_WIN_Msk & (_UINT8_(value) << AC_INTFLAG_WIN_Pos)) 

/* -------- AC_STATUSA : (AC Offset: 0x07) ( R/ 8) Status A -------- */
#define AC_STATUSA_RESETVALUE                 _UINT8_(0x00)                                        /*  (AC_STATUSA) Status A  Reset Value */

#define AC_STATUSA_STATE0_Pos                 _UINT8_(0)                                           /* (AC_STATUSA) Comparator 0 Current State Position */
#define AC_STATUSA_STATE0_Msk                 (_UINT8_(0x1) << AC_STATUSA_STATE0_Pos)              /* (AC_STATUSA) Comparator 0 Current State Mask */
#define AC_STATUSA_STATE0(value)              (AC_STATUSA_STATE0_Msk & (_UINT8_(value) << AC_STATUSA_STATE0_Pos)) /* Assigment of value for STATE0 in the AC_STATUSA register */
#define AC_STATUSA_STATE1_Pos                 _UINT8_(1)                                           /* (AC_STATUSA) Comparator 1 Current State Position */
#define AC_STATUSA_STATE1_Msk                 (_UINT8_(0x1) << AC_STATUSA_STATE1_Pos)              /* (AC_STATUSA) Comparator 1 Current State Mask */
#define AC_STATUSA_STATE1(value)              (AC_STATUSA_STATE1_Msk & (_UINT8_(value) << AC_STATUSA_STATE1_Pos)) /* Assigment of value for STATE1 in the AC_STATUSA register */
#define AC_STATUSA_STATE2_Pos                 _UINT8_(2)                                           /* (AC_STATUSA) Comparator 2 Current State Position */
#define AC_STATUSA_STATE2_Msk                 (_UINT8_(0x1) << AC_STATUSA_STATE2_Pos)              /* (AC_STATUSA) Comparator 2 Current State Mask */
#define AC_STATUSA_STATE2(value)              (AC_STATUSA_STATE2_Msk & (_UINT8_(value) << AC_STATUSA_STATE2_Pos)) /* Assigment of value for STATE2 in the AC_STATUSA register */
#define AC_STATUSA_STATE3_Pos                 _UINT8_(3)                                           /* (AC_STATUSA) Comparator 3 Current State Position */
#define AC_STATUSA_STATE3_Msk                 (_UINT8_(0x1) << AC_STATUSA_STATE3_Pos)              /* (AC_STATUSA) Comparator 3 Current State Mask */
#define AC_STATUSA_STATE3(value)              (AC_STATUSA_STATE3_Msk & (_UINT8_(value) << AC_STATUSA_STATE3_Pos)) /* Assigment of value for STATE3 in the AC_STATUSA register */
#define AC_STATUSA_WSTATE0_Pos                _UINT8_(4)                                           /* (AC_STATUSA) Window 0 Current State Position */
#define AC_STATUSA_WSTATE0_Msk                (_UINT8_(0x3) << AC_STATUSA_WSTATE0_Pos)             /* (AC_STATUSA) Window 0 Current State Mask */
#define AC_STATUSA_WSTATE0(value)             (AC_STATUSA_WSTATE0_Msk & (_UINT8_(value) << AC_STATUSA_WSTATE0_Pos)) /* Assigment of value for WSTATE0 in the AC_STATUSA register */
#define   AC_STATUSA_WSTATE0_ABOVE_Val        _UINT8_(0x0)                                         /* (AC_STATUSA) Signal is above window  */
#define   AC_STATUSA_WSTATE0_INSIDE_Val       _UINT8_(0x1)                                         /* (AC_STATUSA) Signal is inside window  */
#define   AC_STATUSA_WSTATE0_BELOW_Val        _UINT8_(0x2)                                         /* (AC_STATUSA) Signal is below window  */
#define AC_STATUSA_WSTATE0_ABOVE              (AC_STATUSA_WSTATE0_ABOVE_Val << AC_STATUSA_WSTATE0_Pos) /* (AC_STATUSA) Signal is above window Position  */
#define AC_STATUSA_WSTATE0_INSIDE             (AC_STATUSA_WSTATE0_INSIDE_Val << AC_STATUSA_WSTATE0_Pos) /* (AC_STATUSA) Signal is inside window Position  */
#define AC_STATUSA_WSTATE0_BELOW              (AC_STATUSA_WSTATE0_BELOW_Val << AC_STATUSA_WSTATE0_Pos) /* (AC_STATUSA) Signal is below window Position  */
#define AC_STATUSA_WSTATE1_Pos                _UINT8_(6)                                           /* (AC_STATUSA) Window 1 Current State Position */
#define AC_STATUSA_WSTATE1_Msk                (_UINT8_(0x3) << AC_STATUSA_WSTATE1_Pos)             /* (AC_STATUSA) Window 1 Current State Mask */
#define AC_STATUSA_WSTATE1(value)             (AC_STATUSA_WSTATE1_Msk & (_UINT8_(value) << AC_STATUSA_WSTATE1_Pos)) /* Assigment of value for WSTATE1 in the AC_STATUSA register */
#define   AC_STATUSA_WSTATE1_ABOVE_Val        _UINT8_(0x0)                                         /* (AC_STATUSA) Signal is above window  */
#define   AC_STATUSA_WSTATE1_INSIDE_Val       _UINT8_(0x1)                                         /* (AC_STATUSA) Signal is inside window  */
#define   AC_STATUSA_WSTATE1_BELOW_Val        _UINT8_(0x2)                                         /* (AC_STATUSA) Signal is below window  */
#define AC_STATUSA_WSTATE1_ABOVE              (AC_STATUSA_WSTATE1_ABOVE_Val << AC_STATUSA_WSTATE1_Pos) /* (AC_STATUSA) Signal is above window Position  */
#define AC_STATUSA_WSTATE1_INSIDE             (AC_STATUSA_WSTATE1_INSIDE_Val << AC_STATUSA_WSTATE1_Pos) /* (AC_STATUSA) Signal is inside window Position  */
#define AC_STATUSA_WSTATE1_BELOW              (AC_STATUSA_WSTATE1_BELOW_Val << AC_STATUSA_WSTATE1_Pos) /* (AC_STATUSA) Signal is below window Position  */
#define AC_STATUSA_Msk                        _UINT8_(0xFF)                                        /* (AC_STATUSA) Register Mask  */

